
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Effective Objective-C 2.0 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        

    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-mermaid-v8/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    



        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="iOS知识点总结.html" />
    
    
    <link rel="prev" href="../" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../">
            
                <a href="../">
            
                    
                    iOS
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="Effective Objective-C 2.0.html">
            
                <a href="Effective Objective-C 2.0.html">
            
                    
                    Effective Objective-C 2.0
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="iOS知识点总结.html">
            
                <a href="iOS知识点总结.html">
            
                    
                    iOS知识点总结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../">
            
                <a href="../">
            
                    
                    结束
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Effective Objective-C 2.0</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>Effective Objective-C 2.0&#x8FD9;&#x672C;&#x672C;&#x5E94;&#x8BE5;&#x65E9;&#x65E9;&#x5C31;&#x770B;&#xFF0C;&#x6700;&#x8FD1;&#x9762;&#x8BD5;&#x4E86;&#x51E0;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x51FA;&#x81EA;&#x8FD9;&#x91CC;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x5BF9;&#x4E8E;&#x7FFB;&#x8BD1;&#x65B9;&#x6CD5;&#x7A0D;&#x6709;&#x6B20;&#x7F3A;&#xFF0C;&#x5185;&#x5BB9;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x6DF1;&#x5165;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x65E5;&#x573A;&#x5F00;&#x53D1;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x5751;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x597D;&#x7684;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p>
<h2 id="&#x7B2C;&#x4E00;&#x7AE0;-&#x719F;&#x6089;objective-c">&#x7B2C;&#x4E00;&#x7AE0; &#x719F;&#x6089;Objective-C</h2>
<h3 id="1&#x3001;&#x4E86;&#x89E3;objective-c&#x7684;&#x8D77;&#x6E90;">1&#x3001;&#x4E86;&#x89E3;Objective-C&#x7684;&#x8D77;&#x6E90;</h3>
<p>&#x6E90;&#x81F3;Smalltalk</p>
<p>&#x6D88;&#x606F;&#x673A;&#x5236;</p>
<ul>
<li>&#x6D88;&#x606F;&#x7ED3;&#x6784;&#x8BED;&#x8A00;&#x7531;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x51B3;&#x5B9A;</li>
<li>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8BED;&#x8A00;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x51B3;&#x5B9A;</li>
</ul>
<h3 id="2&#x3001;&#x5728;&#x7C7B;&#x6587;&#x4EF6;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x5C3D;&#x91CF;&#x5C11;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x6587;&#x4EF6;">2&#x3001;&#x5728;&#x7C7B;&#x6587;&#x4EF6;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x5C3D;&#x91CF;&#x5C11;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x6587;&#x4EF6;</h3>
<p><code>@class</code>&#xFF1A;&#x5411;&#x524D;&#x58F0;&#x660E;</p>
<p>&#x5C06;&#x5F15;&#x5165;&#x6587;&#x4EF6;&#x5C3D;&#x91CF;&#x5EF6;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x90FD;&#x5728;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x5F15;&#x5165;&#xFF0C;&#x5C06;&#x589E;&#x52A0;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;</p>
<p><code>&#x5411;&#x524D;&#x58F0;&#x660E;</code>&#x4E5F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x95EE;</p>
<h3 id="3&#x3001;&#x591A;&#x7528;&#x5B57;&#x9762;&#x91CF;&#x65B9;&#x6CD5;&#xFF0C;&#x5C11;&#x7528;&#x4E0E;&#x4E4B;&#x7B49;&#x4EF7;&#x7684;&#x65B9;&#x6CD5;">3&#x3001;&#x591A;&#x7528;&#x5B57;&#x9762;&#x91CF;&#x65B9;&#x6CD5;&#xFF0C;&#x5C11;&#x7528;&#x4E0E;&#x4E4B;&#x7B49;&#x4EF7;&#x7684;&#x65B9;&#x6CD5;</h3>
<ol>
<li>&#x7F29;&#x51CF;&#x4EE3;&#x7801;&#x957F;&#x5EA6;&#xFF0C;&#x4F7F;&#x4E4B;&#x66F4;&#x4E3A;&#x6613;&#x8BFB;</li>
<li>&#x5B57;&#x9762;&#x91CF;&#x65B9;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x4F7F;&#x4E00;&#x79CD;&#x8BED;&#x6CD5;&#x7CD6;</li>
</ol>
<blockquote>
<p>&#x8BED;&#x6CD5;&#x7CD6;&#x4E5F;&#x79F0;&#x4E3A;<code>&#x8BED;&#x6CD5;&#x7CD6;&#x8863;</code>&#xFF0C;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x4E0E;&#x53E6;&#x4E00;&#x5957;&#x8BED;&#x6CD5;&#x76F8;&#x540C;&#x7684;&#x4E00;&#x79CD;&#x5199;&#x6CD5;</p>
</blockquote>
<pre><code class="lang-objective-c">NSObject *obj1 = [NSObject new];
NSObject *obj2 = nil;
NSArray *arr1 = [NSArray arrayWithObjects:obj1, obj2, nil];
NSArray *arr2 = @[obj1, obj2];
NSDictionary *dic = @{
    @&quot;obj1&quot;: obj1,
    @&quot;obj2&quot;: obj2
};
</code></pre>
<blockquote>
<p>&#x6570;&#x7EC4;&#x7B2C;&#x4E00;&#x79CD;&#x5199;&#x6CD5;&#x4E0D;&#x4F1A;&#x5D29;&#x6E83;&#xFF0C;&#x4F1A;&#x4F9D;&#x6B21;&#x63D2;&#x5165;&#x53D8;&#x91CF;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E3A;nil<br>&#x6570;&#x7EC4;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F1A;&#x62A5;&#x5F02;&#x5E38;<br>&#x5B57;&#x5178;&#x5B57;&#x9762;&#x91CF;&#x65B9;&#x6CD5;&#x4F1A;&#x62A5;&#x5F02;&#x5E38;</p>
</blockquote>
<pre><code class="lang-objective-c">NSString *str = @&quot;123&quot;;
NSNumber *intNum = @1;
NSNumber *floatNum = @2.3f;
NSNumber *doubleNum = @2.345679;
</code></pre>
<h3 id="4&#x3001;&#x591A;&#x7528;&#x7C7B;&#x5E38;&#x91CF;&#xFF0C;&#x5C11;&#x7528;define">4&#x3001;&#x591A;&#x7528;&#x7C7B;&#x5E38;&#x91CF;&#xFF0C;&#x5C11;&#x7528;#define</h3>
<p><code>&#x5168;&#x5C40;&#x7B26;&#x53F7;&#x8868;</code></p>
<ul>
<li>&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x9884;&#x5904;&#x7406;&#x6307;&#x4EE4;&#x5B9A;&#x4E49;&#x5E38;&#x91CF;&#x3002;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x51FA;&#x6765;&#x7684;&#x5E38;&#x91CF;&#x4E0D;&#x542B;&#x6709;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EA;&#x662F;&#x4F1A;&#x5728;&#x7F16;&#x8BD1;&#x524D;&#x636E;&#x6B64;&#x6267;&#x884C;&#x67E5;&#x627E;&#x4E0E;&#x66FF;&#x6362;&#x64CD;&#x4F5C;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x4EBA;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E86;&#x5E38;&#x91CF;&#x503C;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E5F;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x8B66;&#x544A;&#x4FE1;&#x606F;</li>
<li>&#x5728;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x4E2D;&#x4F7F;&#x7528;<code>static const</code>&#x6765;&#x5B9A;&#x4E49;&#x201C;&#x53EA;&#x5728;&#x7F16;&#x8BD1;&#x5355;&#x5143;&#x5185;&#x53EF;&#x89C1;&#x7684;&#x4EA7;&#x91CF;&#x201D;&#x3002;&#x7531;&#x4E8E;&#x6B64;&#x7C7B;&#x5E38;&#x91CF;&#x4E0D;&#x5728;&#x5168;&#x5C40;&#x7B26;&#x53F7;&#x8868;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x65E0;&#x987B;&#x4E3A;&#x5176;&#x540D;&#x79F0;&#x52A0;&#x524D;&#x7F00;&#x3002;</li>
<li>&#x5728;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#x4F7F;&#x7528;extern&#x6765;&#x58F0;&#x660E;&#x5168;&#x5C40;&#x5E38;&#x91CF;&#xFF0C;&#x5E76;&#x5728;&#x76F8;&#x5173;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x4E2D;&#x5B9A;&#x4E49;&#x5176;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x5E38;&#x91CF;&#x8981;&#x51FA;&#x73B0;&#x5728;&#x5168;&#x5C40;&#x7B26;&#x53F7;&#x8868;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x540D;&#x79F0;&#x5E94;&#x52A0;&#x4EE5;&#x533A;&#x9694;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E0E;&#x4E4B;&#x9999;&#x6E2F;&#x7684;&#x7C7B;&#x540D;&#x79F0;&#x505A;&#x524D;&#x7F00;&#x3002;</li>
</ul>
<h3 id="5&#x3001;&#x7528;&#x679A;&#x4E3E;&#x8868;&#x793A;&#x9009;&#x9879;&#x3001;&#x72B6;&#x6001;&#x3001;&#x72B6;&#x6001;&#x7801;">5&#x3001;&#x7528;&#x679A;&#x4E3E;&#x8868;&#x793A;&#x9009;&#x9879;&#x3001;&#x72B6;&#x6001;&#x3001;&#x72B6;&#x6001;&#x7801;</h3>
<p>&#x5B9E;&#x73B0;&#x679A;&#x4E3E;&#x6240;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x53D6;&#x51B3;&#x4E8E;&#x7F16;&#x8BD1;&#x5668;</p>
<p>Foundation&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x8F85;&#x52A9;&#x5B8F;&#xFF0C;&#x80FD;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x80FD;&#x529B;</p>
<p>&#x5728;C++&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#x4E2D;<code>NS_OPTION</code>&#x6BD4;<code>NS_ENUM</code>&#x5728;&#x5B8F;&#x5B9A;&#x4E49;&#x4E2D;&#x5177;&#x6709;&#x663E;&#x793A;&#x8F6C;&#x6362;&#x7C7B;&#x578B;&#x7684;&#x80FD;&#x529B;</p>
<h2 id="&#x7B2C;&#x4E8C;&#x7AE0;-&#x5BF9;&#x8C61;&#x3001;&#x6D88;&#x606F;&#x3001;&#x8FD0;&#x884C;&#x671F;">&#x7B2C;&#x4E8C;&#x7AE0; &#x5BF9;&#x8C61;&#x3001;&#x6D88;&#x606F;&#x3001;&#x8FD0;&#x884C;&#x671F;</h2>
<h3 id="6&#x3001;&#x7406;&#x89E3;&#x5C5E;&#x6027;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;">6&#x3001;&#x7406;&#x89E3;&#x5C5E;&#x6027;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;</h3>
<p><code>noatomic</code>&#x4E0D;&#x80FD;&#x4F7F;&#x7528;<code>&#x540C;&#x6B65;&#x9501;</code></p>
<h3 id="7&#x3001;&#x5728;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x5C3D;&#x91CF;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;">7&#x3001;&#x5728;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x5C3D;&#x91CF;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;</h3>
<ul>
<li>&#x5728;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6765;&#x8BFB;&#xFF0C;&#x800C;&#x5199;&#x5165;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x5C5E;&#x6027;&#x6765;&#x5199;</li>
<li>&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;dealloc&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x603B;&#x662F;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6765;&#x8BFB;&#x5199;&#x6570;&#x636E;</li>
<li>&#x6709;&#x65F6;&#x4F1A;&#x4F7F;&#x7528;&#x60F0;&#x6027;&#x521D;&#x59CB;&#x5316;&#x6280;&#x672F;&#x6765;&#x914D;&#x7F6E;&#x67D0;&#x5206;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8981;&#x901A;&#x8FC7;&#x5C5E;&#x6027;&#x6765;&#x8BFB;&#x53D6;&#x6570;&#x636E;</li>
</ul>
<h3 id="8&#x3001;&#x7406;&#x89E3;&#x5BF9;&#x8C61;&#x7B49;&#x540C;&#x6027;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;">8&#x3001;&#x7406;&#x89E3;&#x5BF9;&#x8C61;&#x201C;&#x7B49;&#x540C;&#x6027;&#x201D;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;</h3>
<p>NSObject&#x534F;&#x8BAE;&#x4E2D;&#x6709;&#x4E2A;&#x4E24;&#x4E2A;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x7B49;&#x540C;&#x7684;&#x5173;&#x952E;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-objective-c">- (BOOL)isEqual:(id)object;
- (NSUInteger)hash;
</code></pre>
<h3 id="9&#x3001;&#x4EE5;&#x7C7B;&#x7C07;&#x6A21;&#x5F0F;&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;">9&#x3001;&#x4EE5;&#x201C;&#x7C7B;&#x7C07;&#x6A21;&#x5F0F;&#x201D;&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;</h3>
<p><code>&#x5DE5;&#x5382;&#x6A21;&#x5F0F;</code>&#x662F;&#x521B;&#x5EFA;&#x7C7B;&#x7C07;&#x7684;&#x65B9;&#x5F0F;&#x4E4B;&#x4E00;</p>
<h3 id="10&#x3001;&#x5728;&#x65E2;&#x6709;&#x5BF9;&#x8C61;&#x4E2D;&#x5173;&#x8054;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;">10&#x3001;&#x5728;&#x65E2;&#x6709;&#x5BF9;&#x8C61;&#x4E2D;&#x5173;&#x8054;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;</h3>
<ul>
<li>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>&#x5173;&#x8054;&#x5BF9;&#x8C61;</code>&#x673A;&#x5236;&#x6765;&#x628A;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x8FDE;&#x8D77;&#x6765;</li>
<li>&#x5B9A;&#x4E49;&#x5173;&#x8054;&#x5BF9;&#x8C61;&#x65F6;&#x53EF;&#x6307;&#x5B9A;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x8BED;&#x4E49;&#xFF0C;&#x7528;&#x4EE5;&#x6A21;&#x4EFF;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;&#x65F6;&#x6240;&#x91C7;&#x7528;&#x7684;<code>&#x62E5;&#x6709;&#x5173;&#x7CFB;</code>&#x4E0E;<code>&#x975E;&#x62E5;&#x6709;&#x5173;&#x7CFB;</code></li>
<li>&#x53EA;&#x6709;&#x5728;&#x5176;&#x4ED6;&#x505A;&#x6CD5;&#x4E0D;&#x53EF;&#x884C;&#x65F6;&#x624D;&#x5E94;&#x9009;&#x7528;&#x5173;&#x8054;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x901A;&#x5E38;&#x4F1A;&#x5F15;&#x5165;&#x96BE;&#x4EE5;&#x67E5;&#x627E;&#x7684;bug</li>
</ul>
<h3 id="11&#x3001;&#x7406;&#x89E3;objcmsgsend&#x7684;&#x4F5C;&#x7528;">11&#x3001;&#x7406;&#x89E3;objc_msgSend&#x7684;&#x4F5C;&#x7528;</h3>
<ul>
<li>&#x6D88;&#x606F;&#x7531;&#x63A5;&#x53D7;&#x8005;&#x3001;&#x9009;&#x62E9;&#x5B50;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x6784;&#x6210;&#x3002;&#x7ED9;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x201C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x201D;&#x4E5F;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x8BE5;&#x5BF9;&#x8C61;&#x4E0A;&#x201C;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x201D;</li>
<li>&#x53D1;&#x7ED9;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5168;&#x90E8;&#x6D88;&#x606F;&#x8981;&#x7531;&#x201C;&#x52A8;&#x6001;&#x6D88;&#x606F;&#x6D3E;&#x53D1;&#x7CFB;&#x7EDF;&#x201D;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x4F1A;&#x67E5;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x6267;&#x884C;&#x5176;&#x4EE3;&#x7801;</li>
</ul>
<h3 id="12&#x3001;&#x7406;&#x89E3;&#x6D88;&#x606F;&#x8F6C;&#x53D1;&#x673A;&#x5236;">12&#x3001;&#x7406;&#x89E3;&#x6D88;&#x606F;&#x8F6C;&#x53D1;&#x673A;&#x5236;</h3>
<p><img src="https://raw.githubusercontent.com/SirHeng/Necessary/master/Images/&#x6D88;&#x606F;&#x8F6C;&#x53D1;.png" alt="image"></p>
<h3 id="&#x7406;&#x89E3;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x7528;&#x610F;">&#x7406;&#x89E3;&#x201C;&#x7C7B;&#x5BF9;&#x8C61;&#x201D;&#x7684;&#x7528;&#x610F;</h3>
<p><code>isMemberOfClass</code>&#x80FD;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x4E3A;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;</p>
<p><code>isKindOfClass</code>&#x80FD;&#x5224;&#x65AD;&#x5BF9;&#x8C61;&#x4F7F;&#x5426;&#x4E3A;&#x67D0;&#x4E2A;&#x7C7B;&#x6216;&#x8005;&#x8BE5;&#x7C7B;&#x7684;&#x6D3E;&#x751F;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;</p>
<ul>
<li>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x8BA4;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x6BD4;&#x8F83;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x4E86;&#x6D88;&#x606F;&#x8F6C;&#x53D1;</li>
</ul>
<h3 id="13&#x3001;&#x7528;&#x65B9;&#x6CD5;&#x8C03;&#x914D;&#x6280;&#x672F;&#x8C03;&#x8BD5;&#x9ED1;&#x76D2;&#x65B9;&#x6CD5;">13&#x3001;&#x7528;<code>&#x65B9;&#x6CD5;&#x8C03;&#x914D;&#x6280;&#x672F;</code>&#x8C03;&#x8BD5;<code>&#x9ED1;&#x76D2;&#x65B9;&#x6CD5;</code></h3>
<ul>
<li>&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4EFD;&#x5B9E;&#x73B0;&#x6765;&#x66FF;&#x6362;&#x539F;&#x6709;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x9053;&#x5DE5;&#x5E8F;&#x53EB;&#x505A;<code>&#x65B9;&#x6CD5;&#x8C03;&#x914D;</code>&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x5E38;&#x7528;&#x6B64;&#x6280;&#x672F;&#x5411;&#x539F;&#x6709;&#x7684;&#x65B9;&#x6CD5;&#x6DFB;&#x52A0;&#x65B0;&#x529F;&#x80FD;</li>
<li>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x65B9;&#x6CD5;&#x8C03;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x624D;&#x7528;&#x6B64;&#x6280;&#x672F;&#x66FF;&#x6362;&#x539F;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x6B64;&#x6280;&#x672F;&#x4E0D;&#x5B9C;&#x6EE5;&#x7528;</li>
</ul>
<h3 id="14&#x3001;&#x7406;&#x89E3;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x7528;&#x610F;">14&#x3001;&#x7406;&#x89E3;<code>&#x7C7B;&#x5BF9;&#x8C61;</code>&#x7684;&#x7528;&#x610F;</h3>
<ul>
<li>&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6307;&#x5411;<code>Class</code>&#x7684;&#x5BF9;&#x8C61;&#x6307;&#x9488;&#xFF0C;&#x7528;&#x4EE5;&#x8868;&#x660E;&#x5176;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;<code>Class</code>&#x5BF9;&#x8C61;&#x5219;&#x6784;&#x6210;&#x4E86;&#x7C7B;&#x7684;&#x7EE7;&#x627F;&#x5173;&#x7CFB;</li>
<li>&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x65E0;&#x6CD5;&#x5728;&#x7F16;&#x8BD1;&#x671F;&#x786E;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#x7C7B;&#x63A2;&#x77E5;</li>
<li>&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x67E5;&#x8BE2;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x6BD4;&#x8F83;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x4E86;&#x6D88;&#x606F;&#x8F6C;&#x53D1;&#x529F;&#x80FD;</li>
</ul>
<h2 id="&#x7B2C;&#x4E09;&#x7AE0;-&#x63A5;&#x53E3;&#x4E0E;api&#x8BBE;&#x8BA1;">&#x7B2C;&#x4E09;&#x7AE0; &#x63A5;&#x53E3;&#x4E0E;Api&#x8BBE;&#x8BA1;</h2>
<h3 id="15&#x3001;&#x7528;&#x524D;&#x7F00;&#x907F;&#x514D;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x51B2;&#x7A81;">15&#x3001;&#x7528;&#x524D;&#x7F00;&#x907F;&#x514D;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x51B2;&#x7A81;</h3>
<ul>
<li>&#x9009;&#x62E9;&#x4E0E;&#x4F60;&#x516C;&#x53F8;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x8005;&#x4E8C;&#x8FDB;&#x5236;&#x7686;&#x6709;&#x5173;&#x8054;&#x4E4B;&#x540D;&#x79F0;&#x4F5C;&#x7C7B;&#x540D;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x5E76;&#x5728;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x4E2D;&#x5747;&#x4F7F;&#x7528;&#x8FD9;&#x4E00;&#x524D;&#x7F00;</li>
<li>&#x82E5;&#x81EA;&#x5DF1;&#x6240;&#x5F00;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x5E93;&#x4E2D;&#x7528;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#xFF0C;&#x5219;&#x5E94;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x540D;&#x79F0;&#x52A0;&#x4E0A;&#x524D;&#x7F00;</li>
</ul>
<h3 id="16&#x3001;&#x63D0;&#x4F9B;&#x5168;&#x80FD;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;">16&#x3001;&#x63D0;&#x4F9B;&#x5168;&#x80FD;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;</h3>
<ul>
<li>&#x5728;&#x7C7B;&#x4E2D;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5168;&#x80FD;&#x7684;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E8E;&#x6587;&#x6863;&#x91CC;&#x6307;&#x540D;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x5747;&#x5E94;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;</li>
<li>&#x82E5;&#x5168;&#x80FD;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x4E0E;&#x8D85;&#x7C7B;&#x4E0D;&#x540C;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8986;&#x5199;&#x8D85;&#x7C7B;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x65B9;&#x6CD5;</li>
<li>&#x5982;&#x679C;&#x8D85;&#x7C7B;&#x7684;&#x521D;&#x59CB;&#x5316;&#x65B9;&#x6CD5;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5B50;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x8986;&#x5199;&#x8FD9;&#x4E2A;&#x8D85;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x4E2D;&#x629B;&#x51FA;&#x5F02;&#x5E38;</li>
</ul>
<h3 id="17&#x3001;&#x5B9E;&#x73B0;description&#x65B9;&#x6CD5;">17&#x3001;&#x5B9E;&#x73B0;<code>description</code>&#x65B9;&#x6CD5;</h3>
<ul>
<li>&#x5B9E;&#x73B0;<code>description</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7528;&#x4EE5;&#x63CF;&#x8FF0;&#x5B9E;&#x4F8B;</li>
<li>&#x82E5;&#x60F3;&#x5728;&#x8C03;&#x8BD5;&#x65F6;&#x6253;&#x5370;&#x51FA;&#x66F4;&#x6D88;&#x606F;&#x7684;&#x5BF9;&#x8C61;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x5E94;&#x5B9E;&#x73B0;<code>debugDescription</code></li>
</ul>
<h3 id="18&#x3001;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;">18&#x3001;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;</h3>
<ul>
<li>&#x5C3D;&#x91CF;&#x521B;&#x5EFA;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x5BF9;&#x8C61;</li>
<li>&#x82E5;&#x67D0;&#x5C5E;&#x6027;&#x4EC5;&#x53EF;&#x7528;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x90E8;&#x4FEE;&#x6539;</li>
<li>&#x5219;&#x5E94;&#x8BE5;&#x5728;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x4E2D;&#x5C06;&#x5176;&#x7531;<code>readonly</code>&#x5C5E;&#x6027;&#x6269;&#x5C55;&#x4E3A;<code>readwrite</code>&#x5C5E;&#x6027;</li>
<li>&#x4E0D;&#x8981;&#x628A;&#x4E0D;&#x53EF;&#x53D8;&#x7684;<code>collection</code>&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#x516C;&#x5F00;&#xFF0C;&#x800C;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x76F8;&#x5173;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x6B64;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x53EF;&#x53D8;<code>collection</code></li>
</ul>
<h3 id="19&#x3001;&#x4F7F;&#x7528;&#x6E05;&#x6670;&#x800C;&#x534F;&#x8C03;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;">19&#x3001;&#x4F7F;&#x7528;&#x6E05;&#x6670;&#x800C;&#x534F;&#x8C03;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;</h3>
<ul>
<li>&#x8D77;&#x540D;&#x65F6;&#x5E94;&#x9075;&#x5FAA;&#x6807;&#x51C6;&#x7684;Objective-C&#x547D;&#x540D;&#x89C4;&#x8303;&#xFF0C;&#x8FD9;&#x6837;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#x63A5;&#x53E3;&#x66F4;&#x5BB9;&#x6613;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x6240;&#x7406;&#x89E3;</li>
<li>&#x65B9;&#x6CD5;&#x540D;&#x8981;&#x8A00;&#x7B80;&#x610F;&#x8D45;&#xFF0C;&#x4ECE;&#x5DE6;&#x81F3;&#x53F3;&#x8BFB;&#x8D77;&#x6765;&#x8981;&#x50CF;&#x4E2A;&#x65E5;&#x5E38;&#x7528;&#x8BED;&#x4E2D;&#x7684;&#x53E5;&#x5B50;&#x624D;&#x597D;</li>
<li>&#x65B9;&#x6CD5;&#x540D;&#x91CC;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x7F29;&#x7565;&#x540E;&#x7684;&#x7C7B;&#x578B;&#x540D;&#x79F0;</li>
<li>&#x7ED9;&#x65B9;&#x6CD5;&#x8D77;&#x540D;&#x65F6;&#x7684;&#x7B2C;&#x4E00;&#x8981;&#x52A1;&#x5C31;&#x662F;&#x786E;&#x4FDD;&#x5176;&#x98CE;&#x683C;&#x4E0E;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x6240;&#x8981;&#x96C6;&#x6210;&#x7684;&#x6846;&#x67B6;&#x76F8;&#x7B26;</li>
</ul>
<h3 id="20&#x3001;&#x4E3A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x540D;&#x52A0;&#x524D;&#x7F00;">20&#x3001;&#x4E3A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x540D;&#x52A0;&#x524D;&#x7F00;</h3>
<ul>
<li>&#x7ED9;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x52A0;&#x4E0A;&#x524D;&#x7F00;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5C06;&#x5176;&#x540C;&#x516C;&#x5171;&#x65B9;&#x6CD5;&#x533A;&#x5206;&#x5F00;</li>
<li>&#x4E0D;&#x8981;&#x5355;&#x7528;&#x4E00;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#x505A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x662F;&#x9884;&#x7559;&#x7ED9;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x7528;&#x7684;</li>
</ul>
<h3 id="21&#x3001;&#x7406;&#x89E3;objective-c&#x9519;&#x8BEF;&#x6A21;&#x578B;">21&#x3001;&#x7406;&#x89E3;Objective-C&#x9519;&#x8BEF;&#x6A21;&#x578B;</h3>
<ul>
<li>&#x53EA;&#x6709;&#x53D1;&#x751F;&#x4E86;&#x53EF;&#x4F7F;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x7684;&#x4E25;&#x91CD;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x624D;&#x5E94;&#x4F7F;&#x7528;&#x5F02;&#x5E38;</li>
<li>&#x5728;&#x9519;&#x8BEF;&#x4E0D;&#x90A3;&#x4E48;&#x4E25;&#x91CD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x6D3E;<code>&#x59D4;&#x6258;&#x65B9;&#x6CD5;</code>&#x6765;&#x5904;&#x7406;&#x9519;&#x8BEF;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x653E;&#x5728;NSError&#x5BF9;&#x8C61;&#x91CC;&#xFF0C;&#x7ECF;&#x7531;&#x201C;&#x8F93;&#x51FA;&#x53C2;&#x6570;&#x201D;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;</li>
</ul>
<h3 id="22&#x3001;&#x7406;&#x89E3;nscopying&#x534F;&#x8BAE;">22&#x3001;&#x7406;&#x89E3;NSCopying&#x534F;&#x8BAE;</h3>
<ul>
<li>&#x82E5;&#x60F3;&#x4EE4;&#x81EA;&#x5DF1;&#x6240;&#x5199;&#x7684;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x62F7;&#x8D1D;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x9700;&#x5B9E;&#x73B0;NSCopying&#x534F;&#x8BAE;</li>
<li>&#x5982;&#x679C;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x5206;&#x4E3A;&#x53EF;&#x53D8;&#x7248;&#x672C;&#x4E0E;&#x4E0D;&#x53EF;&#x53D8;&#x7248;&#x672C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x540C;&#x65F6;&#x5B9E;&#x73B0;NSCopying&#x4E0E;NSMutableCopying&#x534F;&#x8BAE;</li>
<li>&#x590D;&#x5236;&#x5BF9;&#x8C61;&#x65F6;&#x9700;&#x8981;&#x51B3;&#x5B9A;&#x91C7;&#x7528;&#x6D45;&#x62F7;&#x8D1D;&#x8FD8;&#x662F;&#x6DF1;&#x62F7;&#x8D1D;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x6267;&#x884C;&#x6D45;&#x6D45;&#x62F7;&#x8D1D;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x6240;&#x5199;&#x7684;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x6DF1;&#x62F7;&#x8D1D;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x65B0;&#x589E;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x6267;&#x884C;&#x6D45;&#x62F7;&#x8D1D;&#x7684;&#x65B9;&#x6CD5;</li>
</ul>
<h2 id="&#x7B2C;&#x56DB;&#x7AE0;-&#x534F;&#x8BAE;&#x4E0E;&#x5206;&#x7C7B;">&#x7B2C;&#x56DB;&#x7AE0; &#x534F;&#x8BAE;&#x4E0E;&#x5206;&#x7C7B;</h2>
<h3 id="23&#x3001;&#x901A;&#x8FC7;&#x59D4;&#x6258;&#x4E0E;&#x6570;&#x636E;&#x6E90;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x95F4;&#x901A;&#x4FE1;">23&#x3001;&#x901A;&#x8FC7;&#x59D4;&#x6258;&#x4E0E;&#x6570;&#x636E;&#x6E90;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x5BF9;&#x8C61;&#x95F4;&#x901A;&#x4FE1;</h3>
<ul>
<li>&#x59D4;&#x6258;&#x6A21;&#x5F0F;&#x4E3A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5957;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x5176;&#x53EF;&#x7531;&#x6B64;&#x5C06;&#x76F8;&#x5173;&#x65F6;&#x95F4;&#x544A;&#x77E5;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;</li>
<li>&#x5C06;&#x59D4;&#x6258;&#x5BF9;&#x8C61;&#x5E94;&#x8BE5;&#x652F;&#x6301;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x6210;&#x534F;&#x8BAE;&#xFF0C;&#x5728;&#x534F;&#x8BAE;&#x4E2D;&#x628A;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x4EF6;&#x5B9A;&#x4E49;&#x6210;&#x65B9;&#x6CD5;</li>
<li>&#x5F53;&#x67D0;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x4ECE;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x59D4;&#x6258;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x666F;&#x4E0B;&#xFF0C;&#x8BE5;&#x6A21;&#x5F0F;&#x4EA6;&#x79F0;&#x201C;&#x6570;&#x636E;&#x6E90;&#x534F;&#x8BAE;&#x201D;</li>
<li>&#x82E5;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x5219;&#x53EF;&#x5B9E;&#x73B0;&#x73AF;&#x6E38;&#x4F4D;&#x6BB5;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x5C06;&#x59D4;&#x6258;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x80FD;&#x54CD;&#x5E94;&#x76F8;&#x5173;&#x534F;&#x8BAE;&#x65B9;&#x6CD5;&#x8FD9;&#x4E00;&#x4FE1;&#x606F;&#x7F13;&#x5B58;&#x81F3;&#x5176;&#x4E2D;</li>
</ul>
<h3 id="24&#x3001;&#x5C06;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x5206;&#x6563;&#x5230;&#x4FBF;&#x4E8E;&#x7BA1;&#x7406;&#x7684;&#x5404;&#x4E2A;&#x5206;&#x7C7B;&#x4E2D;">24&#x3001;&#x5C06;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x5206;&#x6563;&#x5230;&#x4FBF;&#x4E8E;&#x7BA1;&#x7406;&#x7684;&#x5404;&#x4E2A;&#x5206;&#x7C7B;&#x4E2D;</h3>
<p>&#x5404;&#x4E2A;&#x5206;&#x7C7B;&#x4EE3;&#x7801;&#x90FD;&#x5B9E;&#x73B0;&#x5728;&#x4E3B;&#x7C7B;&#x4E2D;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x5206;&#x7C7B;&#x673A;&#x5236;&#x628A;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x5212;&#x5206;&#x6210;&#x6613;&#x4E8E;&#x7BA1;&#x7406;&#x7684;&#x5C0F;&#x5757;</li>
<li>&#x5C06;&#x5E94;&#x8BE5;&#x89C6;&#x4E3A;&#x201C;&#x79C1;&#x6709;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#x5F52;&#x5165;&#x540D;&#x53EB;<code>Private</code>&#x7684;&#x5206;&#x7C7B;&#x4E2D;&#xFF0C;&#x4EE5;&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;</li>
</ul>
<h3 id="25&#x3001;&#x603B;&#x662F;&#x4E3A;&#x7B2C;&#x4E09;&#x65B9;&#x5206;&#x7C7B;&#x7684;&#x540D;&#x79F0;&#x52A0;&#x524D;&#x7F00;">25&#x3001;&#x603B;&#x662F;&#x4E3A;&#x7B2C;&#x4E09;&#x65B9;&#x5206;&#x7C7B;&#x7684;&#x540D;&#x79F0;&#x52A0;&#x524D;&#x7F00;</h3>
<ul>
<li>&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x7C7B;&#x4E2D;&#x6DFB;&#x52A0;&#x5206;&#x7C7B;&#x65F6;&#xFF0C;&#x603B;&#x5E94;&#x7ED9;&#x5176;&#x540D;&#x79F0;&#x52A0;&#x4E0A;&#x4F60;&#x4E13;&#x7528;&#x7684;&#x524D;&#x7F00;</li>
<li>&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x7C7B;&#x4E2D;&#x6DFB;&#x52A0;&#x5206;&#x7C7B;&#x65F6;&#xFF0C;&#x603B;&#x5E94;&#x7ED9;&#x5176;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x52A0;&#x4E0A;&#x4F60;&#x4E13;&#x7528;&#x7684;&#x524D;&#x7F00;</li>
</ul>
<h3 id="26&#x3001;&#x52FF;&#x5728;&#x5206;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x5C5E;&#x6027;">26&#x3001;&#x52FF;&#x5728;&#x5206;&#x7C7B;&#x4E2D;&#x58F0;&#x660E;&#x5C5E;&#x6027;</h3>
<ul>
<li>&#x628A;&#x5C01;&#x88C5;&#x6570;&#x636E;&#x6240;&#x7528;&#x7684;&#x5168;&#x90E8;&#x5C5E;&#x6027;&#x90FD;&#x5B9A;&#x4E49;&#x5728;&#x4E3B;&#x63A5;&#x53E3;&#x91CC;</li>
<li>&#x5728;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x5206;&#x7C7B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5B58;&#x53D6;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;</li>
</ul>
<h3 id="27&#x3001;&#x4F7F;&#x7528;class-continuation&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;">27&#x3001;&#x4F7F;&#x7528;<code>class-continuation</code>&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;</h3>
<ul>
<li>&#x901A;&#x8FC7;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x5411;&#x7C7B;&#x4E2D;&#x65B0;&#x589E;&#x52A0;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;</li>
<li>&#x5982;&#x679C;&#x67D0;&#x5C5E;&#x6027;&#x5728;&#x4E3B;&#x63A5;&#x53E3;&#x4E2D;&#x58F0;&#x660E;&#x4E3A;&#x201C;&#x53EA;&#x8BFB;&#x201D;&#xFF0C;&#x800C;&#x5206;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x5B9A;&#x4E49;&#x53C8;&#x8981;&#x7528;&#x8BBE;&#x7F6E;&#x65B9;&#x6CD5;&#x4FEE;&#x6539;&#x6B64;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5728;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x4E2D;&#x5C06;&#x5176;&#x6269;&#x5C55;&#x4E3A;&#x201C;&#x53EF;&#x8BFB;&#x5199;&#x201D;</li>
<li>&#x628A;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x7684;&#x539F;&#x578B;&#x58F0;&#x660E;&#x5728;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x91CC;&#x9762;</li>
<li>&#x82E5;&#x60F3;&#x4F7F;&#x7C7B;&#x6240;&#x9075;&#x5FAA;&#x7684;&#x534F;&#x8BAE;&#x4E0D;&#x4E3A;&#x4EBA;&#x6240;&#x77E5;&#xFF0C;&#x5219;&#x53EF;&#x4E8E;&#x201C;class-continuation&#x5206;&#x7C7B;&#x201D;&#x4E2D;&#x58F0;&#x660E;</li>
</ul>
<h3 id="28&#x3001;&#x901A;&#x8FC7;&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x533F;&#x540D;&#x5BF9;&#x8C61;">28&#x3001;&#x901A;&#x8FC7;&#x534F;&#x8BAE;&#x63D0;&#x4F9B;&#x533F;&#x540D;&#x5BF9;&#x8C61;</h3>
<ul>
<li>&#x534F;&#x8BAE;&#x53EF;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x4F9B;&#x533F;&#x540D;&#x7C7B;&#x578B;&#x3002;&#x5177;&#x4F53;&#x7684;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x6DE1;&#x5316;&#x6210;&#x9075;&#x4ECE;&#x67D0;&#x534F;&#x8BAE;&#x7684;id&#x7C7B;&#x578B;&#xFF0C;&#x534F;&#x8BAE;&#x91CC;&#x89C4;&#x5B9A;&#x4E86;&#x5BF9;&#x8C61;&#x6240;&#x5E94;&#x5B9E;&#x73B0;&#x7684;&#x65B9;&#x6CD5;</li>
<li>&#x4F7F;&#x7528;&#x533F;&#x540D;&#x5BF9;&#x8C61;&#x6765;&#x9690;&#x85CF;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#xFF08;&#x6216;&#x7C7B;&#x540D;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4F7F;&#x5BF9;&#x8C61;&#x80FD;&#x591F;&#x54CD;&#x5E94;&#xFF08;&#x5B9A;&#x4E49;&#x5728;&#x534F;&#x8BAE;&#x91CC;&#x7684;&#xFF09;&#x7279;&#x5B9A;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x5BF9;&#x8C61;&#x6765;&#x8868;&#x793A;</li>
</ul>
<h2 id="&#x5185;&#x5B58;&#x7BA1;&#x7406;">&#x5185;&#x5B58;&#x7BA1;&#x7406;</h2>
<h3 id="29&#x3001;&#x7406;&#x89E3;&#x5F15;&#x7528;&#x8BA1;&#x6570;">29&#x3001;&#x7406;&#x89E3;&#x5F15;&#x7528;&#x8BA1;&#x6570;</h3>
<ul>
<li>Retain &#x9012;&#x589E;&#x5F15;&#x7528;&#x8BA1;&#x6570;</li>
<li>Release &#x9012;&#x51CF;&#x5F15;&#x7528;&#x8BA1;&#x6570; </li>
<li>autorelease &#x5F85;&#x7A0D;&#x540E;&#x6E05;&#x7406;&#x201C;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x201D;&#x65F6;&#xFF0C;&#x5728;&#x9012;&#x589E;&#x5F15;&#x7528;&#x8BA1;&#x6570;</li>
</ul>
<p><code>retainCount</code>&#x67E5;&#x770B;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x4E0D;&#x592A;&#x6709;&#x7528;&#xFF0C;&#x5373;&#x4FBF;&#x5728;&#x8C03;&#x8BD5;&#x65F6;&#x4E5F;&#x5982;&#x6B64;</p>
<blockquote>
<p>&#x5B98;&#x65B9;&#x6587;&#x6863;&#xFF1A;&#x8C03;&#x8BD5;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x65F6;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x4FDD;&#x4E0D;&#x51C6;Cocoa framework&#x4E2D;&#x7684;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x4F1A;retain&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD8;&#x6709;&#x5BF9;&#x4E8E;autorelease pool&#x4E2D;&#x7684;&#x5EF6;&#x8FDF;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#xFF0C;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E5F;&#x5F97;&#x4E0D;&#x5230;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x81F3;&#x5C11;&#x4E3A;<code>1</code></p>
<p>&#x5F53;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E3A;<code>0</code>&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5BF9;&#x8C61;&#x5C31;&#x5185;&#x5B58;&#x5C31;&#x56DE;&#x6536;&#x4E86;&#xFF08;deallocated&#xFF09;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x6807;&#x8BB0;&#x4E3A;<code>reuse</code>&#xFF0C;&#x6240;&#x6709;&#x6307;&#x5411;&#x8BE5;&#x5185;&#x5B58;&#x7684;&#x6307;&#x9488;&#x90FD;&#x4F1A;&#x65E0;&#x6548;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8C03;&#x7528;release&#x540E;&#xFF0C;&#x57FA;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x5176;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x964D;&#x81F3;0&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x5185;&#x5B58;&#x4E5F;&#x8BB8;&#x4F1A;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x518D;&#x4F7F;&#x7528;&#x8BE5;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x5C31;&#x5C06;&#x4F7F;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x4E86;&#x3002;&#x8FD9;&#x91CC;&#x53EA;&#x8BF4;&#x201C;&#x53EF;&#x80FD;&#x201D;&#xFF0C;&#x800C;&#x6CA1;&#x8BF4;&#x201C;&#x4E00;&#x5B9A;&#x201D; &#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x518D;&#x201C;&#x63A5;&#x89E6;&#x5206;&#x914D;&#x201D;&#x4E4B;&#x540E;&#xFF0C;&#x53EA;&#x662F;&#x653E;&#x56DE;&#x201C;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6C60;&#x201D;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5C1A;&#x672A;&#x8986;&#x5199;&#x8BE5;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x5BF9;&#x8C61;&#x4ECD;&#x7136;&#x6709;&#x6548;&#xFF0C;&#x8FD9;&#x65F6;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x5D29;&#x6E83;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF1A;&#x8FC7;&#x65E9;&#x7684;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x800C;&#x5BFC;&#x81F4;&#x7684;bug&#x5F88;&#x96BE;&#x8C03;&#x8BD5;</p>
<p>&#x4E3A;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x822C;&#x8C03;&#x7528;&#x4E86;release&#x540E;&#x90FD;&#x4F1A;&#x6E05;&#x7A7A;&#x6307;&#x9488;&#x3002;&#x8FD9;&#x6837;&#x80FD;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x53EF;&#x80FD;&#x6307;&#x5411;&#x65E0;&#x6548;&#x5BF9;&#x8C61;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x79CD;&#x6307;&#x9488;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x60AC;&#x6302;&#x6307;&#x9488;&#x201D;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x9632;&#x6B62;&#x6B64;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#xFF1A;</p>
<pre><code class="lang-objective-c">NSNumber *number = [[NSNumber alloc] init];
[arrary addObject:number];
[number release];
number = nil;
</code></pre>
<h4 id="&#x5C5E;&#x6027;&#x5B58;&#x53D6;&#x65B9;&#x6CD5;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;">&#x5C5E;&#x6027;&#x5B58;&#x53D6;&#x65B9;&#x6CD5;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;</h4>
<pre><code class="lang-objective-c">- (void)setFoo:(id)foo {
    [foo retain];
    [_foo release];
    _foo = foo;
}
</code></pre>
<h4 id="&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;">&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;</h4>
<p>&#x5728;Objective-C&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x65F6;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#x3002;&#x8C03;&#x7528;release&#x4F1A;&#x7ACB;&#x523B;&#x9012;&#x51CF;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF08;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x53EF;&#x80FD;&#x4EE4;&#x7CFB;&#x7EDF;&#x56DE;&#x6536;&#x6B64;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x7136;&#x800C;&#x6709;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4E0D;&#x6389;&#x7528;&#x4ED6;&#xFF0C;&#x6539;&#x4E3A;<code>autorelease</code>&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x4F1A;&#x5728;&#x7A0D;&#x5019;&#x9012;&#x51CF;&#x8BA1;&#x6570;&#xFF0C;&#x901A;&#x5E38;&#x65F6;&#x4E0B;&#x4E00;&#x6B21;&#x201C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x201D;&#x65F6;&#x9012;&#x51CF;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x53EF;&#x80FD;&#x6267;&#x884C;&#x7684;&#x66F4;&#x65E9;&#xFF08;&#x53C2;&#x89C1;&#x7B2C;34&#x6761;&#xFF09;</p>
<pre><code class="lang-objective-c">- (NSString *)stringValue {
    NSString *str = [[NSString alloc] initWithFormat:@&quot;I am this: %@&quot;, self];
    // return str; &#x4E0D;&#x80FD;&#x8FD9;&#x4E48;&#x5199;&#xFF0C;&#x56E0;&#x4E3A;alloc&#x4F7F;&#x5185;&#x5B58;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x52A0;&#x4E00;
    // [str release] &#x4E5F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;release&#xFF0C;&#x56E0;&#x4E3A;&#x8FD4;&#x56DE;&#x7684;&#x8981;&#x7528;
    return [str autorelease]; // &#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x518D;&#x4E0B;&#x4E00;&#x6B21;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x4E2D;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x51CF;&#x4E00;&#xFF0C;&#x5BF9;&#x5916;&#x90E8;&#x6CA1;&#x6709;&#x5F71;&#x54CD;
}
</code></pre>
<p>&#x5982;&#x679C;&#x6309;&#x201C;&#x5F15;&#x7528;&#x6811;&#x201D;&#x56DE;&#x6EAF;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x7EC8;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x6839;&#x5BF9;&#x8C61;&#xFF0C;&#x5728;mac os&#x4E2D;&#x5C31;&#x662F;NSApplication&#x5BF9;&#x8C61;&#xFF1B;&#x5728;iOS&#x4E2D;&#x5219;&#x8BD5;UIApplication&#x3002;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x521B;&#x7684;&#x5355;&#x4F8B;&#x3002;</p>
<h3 id="30&#x3001;&#x4EE5;arc&#x7B80;&#x5316;&#x5F15;&#x7528;&#x8BA1;&#x6570;">30&#x3001;&#x4EE5;ARC&#x7B80;&#x5316;&#x5F15;&#x7528;&#x8BA1;&#x6570;</h3>
<p>&#x82E5;&#x65B9;&#x6CD5;&#x540D;&#x4EE5;&#x4E0B;&#x5217;&#x8BCD;&#x8BED;&#x5F00;&#x5934;&#xFF0C;&#x5219;&#x5176;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x5F52;&#x8C03;&#x7528;&#x8005;&#x6240;&#x6709;&#xFF1A;</p>
<ul>
<li>alloc</li>
<li>new</li>
<li>copy</li>
<li>mutableCopy
&#x5F52;&#x8C03;&#x7528;&#x8005;&#x6240;&#x6709;&#x7684;&#x610F;&#x601D;&#x65F6;&#xFF1A;&#x8C03;&#x7528;&#x4E0A;&#x8FF0;&#x56DB;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x65B9;&#x6CD5;&#x6240;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x3002;</li>
</ul>
<p>&#x82E5;&#x65B9;&#x6CD5;&#x540D;&#x4E0D;&#x4EE5;&#x4E0A;&#x8FF0;&#x56DB;&#x4E2A;&#x8BCD;&#x8BED;&#x5F00;&#x5934;&#xFF0C;&#x5219;&#x8868;&#x793A;&#x5176;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x4E0D;&#x5F52;&#x8C03;&#x7528;&#x8005;&#x6240;&#x6709;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x503C;&#x518D;&#x8DE8;&#x8D8A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x8FB9;&#x754C;&#x540E;&#x4F9D;&#x7136;&#x6709;&#x6548;&#x3002;&#x8981;&#x60F3;&#x4F7F;&#x5BF9;&#x8C61;&#x591A;&#x5B58;&#x6D3B;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x4EE4;&#x8C03;&#x7528;&#x8005;&#x4FDD;&#x7559;&#x5B83;&#x624D;&#x884C;</p>
<pre><code class="lang-objective-c">+ (EOCPerson*)newPerson {
    EOCPerson *person = [[EOCPerson alloc] init]; 
    return person;
    /**
    * The method name begins with &apos;new&apos;, and since &apos;person&apos; * already has an unbalanced +1 retain count from the
    * &apos;alloc&apos;, no retains, releases, or autoreleases are
    * required when returning.
    */
}

+ (EOCPerson*)somePerson {
    EOCPerson *person = [[EOCPerson alloc] init]; 
    return person;
    /**
    * The method name does not begin with one of the &quot;owning&quot;
    * prefixes, therefore ARC will add an autorelease when
    * returning &apos;person&apos;.
    * The equivalent manual reference counting statement is:
    * return [person autorelease];
    */
}

- (void)doSomething {
    EOCPerson *personOne = [EOCPerson newPerson]; // ...
    EOCPerson *personTwo = [EOCPerson somePerson]; // ...
    /**
    * At this point, &apos;personOne&apos; and &apos;personTwo&apos; go out of 
    * scope, therefore ARC needs to clean them up as required. 
    * - &apos;personOne&apos; was returned as owned by this block of
    * code, so it needs to be released.
    * - &apos;personTwo&apos; was returned not owned by this block of
    * code, so it does not need to be released.
    * The equivalent manual reference counting cleanup code * is:
    * [personOne release];
    */
}
</code></pre>
<p>ARC&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x68C0;&#x6D4B;&#x5230;&#x591A;&#x4F59;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-objective-c">EOCPerson *tmp = [EOCPerson personWithName:@&quot;Bob Smith&quot;]; &#x3001;/_myPerson = [tmp retain]; // add by arc
</code></pre>
<p>&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#xFF0C;arc&#x4E2D;&#x4F1A;&#x52A0;&#x4E0A;retain&#xFF0C;&#x6240;&#x4EE5;&#x5185;&#x90E8;autorelease&#x548C;&#x5916;&#x90E8;retain&#x90FD;&#x53EF;&#x4EE5;&#x53BB;&#x6389;&#xFF0C;&#x6539;&#x4E3A;&#x4EE5;&#x4E0B;&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code class="lang-objective-c">// Within EOCPerson class
+ (EOCPerson*)personWithName:(NSString*)name { 
    EOCPerson *person = [[EOCPerson alloc] init]; person.name = name;
    objc_autoreleaseReturnValue(person);
}
// Code using EOCPerson class
EOCPerson *tmp = [EOCPerson personWithName:@&quot;Matt Galloway&quot;];_myPerson = objc_retainAutoreleasedReturnValue(tmp);
</code></pre>
<h4 id="arc&#x5982;&#x4F55;&#x6E05;&#x7406;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;">ARC&#x5982;&#x4F55;&#x6E05;&#x7406;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;</h4>
<p>.cxx_destruc</p>
<h3 id="31&#x3001;&#x5728;dealloc&#x65B9;&#x6CD5;&#x4E2D;&#x53EA;&#x91CA;&#x653E;&#x5F15;&#x7528;&#x5E76;&#x63A5;&#x89E6;&#x76D1;&#x542C;">31&#x3001;&#x5728;dealloc&#x65B9;&#x6CD5;&#x4E2D;&#x53EA;&#x91CA;&#x653E;&#x5F15;&#x7528;&#x5E76;&#x63A5;&#x89E6;&#x76D1;&#x542C;</h3>
<ul>
<li>&#x5728;dealloc&#x65B9;&#x6CD5;&#x91CC;&#xFF0C;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x91CA;&#x653E;&#x6307;&#x5411;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x5E76;&#x53D6;&#x6D88;&#x539F;&#x6765;&#x7684;&#x8BA2;&#x9605;&#x201C;&#x952E;&#x503C;&#x89C2;&#x6D4B;&#x201D;&#xFF08;KVO&#xFF09;&#x6216;&#x8005;NSNotificationCenter&#x7B49;&#x901A;&#x77E5;&#xFF0C;&#x4E0D;&#x8981;&#x505A;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x6301;&#x6709;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x7B49;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x4E13;&#x95E8;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x91CA;&#x653E;&#x6B64;&#x79CD;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#x8981;&#x548C;&#x5176;&#x4ED6;&#x4F7F;&#x7528;&#x8005;&#x7EA6;&#x5B9A;&#xFF1A;&#x7528;&#x5B8C;&#x8D44;&#x6E90;&#x540E;&#x5FC5;&#x987B;&#x8C03;&#x7528;<code>close</code>&#x65B9;&#x6CD5;</li>
<li>&#x6267;&#x884C;&#x5F02;&#x6B65;&#x4EFB;&#x52A1;&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;dealloc&#x91CC;&#x8C03;&#x7528;&#xFF1A;&#x53EA;&#x80FD;&#x5728;&#x6B63;&#x5E38;&#x72B6;&#x6001;&#x4E0B;&#x6267;&#x884C;&#x7684;&#x90A3;&#x4E9B;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;dealloc&#x91CC;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x5BF9;&#x8C61;&#x5DF2;&#x5904;&#x4E8E;&#x6B63;&#x5728;&#x56DE;&#x6536;&#x7684;&#x72B6;&#x6001;&#x4E86;</li>
</ul>
<h3 id="32&#x3001;&#x7F16;&#x5199;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x65F6;&#x7559;&#x610F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x95EE;&#x9898;">32&#x3001;&#x7F16;&#x5199;&#x201C;&#x5F02;&#x5E38;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x201D;&#x65F6;&#x7559;&#x610F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x95EE;&#x9898;</h3>
<ul>
<li>&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x8981;&#x6CE8;&#x610F;&#x5C06;try&#x5757;&#x5185;&#x6240;&#x521B;&#x7ACB;&#x7684;&#x5BF9;&#x8C61;&#x6E05;&#x7406;&#x5E72;&#x51C0;</li>
<li>&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;ARC&#x4E0D;&#x751F;&#x6210;&#x5B89;&#x5168;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x6E05;&#x7406;&#x4EE3;&#x7801;&#x3002;&#x5F00;&#x542F;&#x7F16;&#x8BD1;&#x5668;&#x6807;&#x5FD7;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x8FD9;&#x79CD;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F1A;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5927;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x964D;&#x4F4E;&#x8FD0;&#x884C;&#x6548;&#x7387;</li>
</ul>
<h3 id="33&#x3001;&#x4EE5;&#x5F31;&#x5F15;&#x7528;&#x907F;&#x514D;&#x4FDD;&#x7559;&#x94FE;">33&#x3001;&#x4EE5;&#x5F31;&#x5F15;&#x7528;&#x907F;&#x514D;&#x4FDD;&#x7559;&#x94FE;</h3>
<ul>
<li>&#x5C06;&#x67D0;&#x4E9B;&#x5F15;&#x7528;&#x8BBE;&#x4E3A;<code>weak</code>&#xFF0C;&#x53EF;&#x907F;&#x514D;&#x51FA;&#x73B0;&#x4FDD;&#x7559;&#x73AF;</li>
<li><code>weak</code>&#x5F15;&#x7528;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6E05;&#x7406;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x81EA;&#x52A8;&#x6E05;&#x7A7A;&#x3002;&#x81EA;&#x52A8;&#x60C5;&#x51B5;&#x65F6;&#x968F;&#x7740;ARC&#x800C;&#x5F15;&#x5165;&#x7684;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x7531;&#x8FD0;&#x884C;&#x671F;&#x7CFB;&#x7EDF;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x5177;&#x5907;&#x81EA;&#x52A8;&#x60C5;&#x51B5;&#x529F;&#x80FD;&#x7684;&#x5F31;&#x5F15;&#x7528;&#x662F;&#x54EA;&#x4E2A;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x8BFB;&#x53D6;&#x5176;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5F15;&#x7528;&#x4E0D;&#x4F1A;&#x6307;&#x5411;&#x5DF2;&#x7ECF;&#x56DE;&#x6536;&#x8FC7;&#x7684;&#x5BF9;&#x8C61;</li>
</ul>
<h3 id="34&#x3001;&#x4EE5;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x5757;&#x964D;&#x4F4E;&#x5185;&#x5B58;&#x5CF0;&#x503C;">34&#x3001;&#x4EE5;&#x201C;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x5757;&#x201D;&#x964D;&#x4F4E;&#x5185;&#x5B58;&#x5CF0;&#x503C;</h3>
<pre><code class="lang-objective-c">int main(int argc, char *argv[]) { 
    @autoreleasepool {
        return UIApplicationMain(argc, argv, nil, @&quot;EOCAppDelegate&quot;);
    } 
}
</code></pre>
<p>&#x4ECE;&#x6280;&#x672F;&#x89D2;&#x5EA6;&#xFF0C;&#x4E0D;&#x662F;&#x975E;&#x5F97;&#x6709;&#x4E2A;&#x201C;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5757;&#x201D;&#x624D;&#x884C;&#x3002;&#x56E0;&#x4E3A;&#x5757;&#x7684;&#x672B;&#x5C3E;&#x6070;&#x597D;&#x65F6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7EC8;&#x6B62;&#x5904;&#xFF0C;&#x800C;&#x6B64;&#x65F6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x628A;&#x7A0B;&#x5E8F;&#x6240;&#x5360;&#x7528;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5B58;&#x9017;&#x91CA;&#x653E;&#x6389;&#x3002;&#x867D;&#x8BF4;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E0D;&#x5199;&#x8FD9;&#x4E2A;&#x5757;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x7531;&#x4E8E;UIApplication&#x51FD;&#x6570;&#x6240;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x7684;&#x90A3;&#x4E9B;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x7CFB;&#x7EDF;&#x4F1A;&#x53D1;&#x51FA;&#x8B66;&#x544A;&#x4FE1;&#x606F;&#x6765;&#x8868;&#x660E;&#x8FD9;&#x4E00;&#x60C5;&#x51B5;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6C60;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6210;&#x6700;&#x5916;&#x56F4;&#x6355;&#x6349;&#x5168;&#x90E8;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x6240;&#x6709;&#x5730;</p>
<ul>
<li>&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x6392;&#x5E03;&#x5728;&#x6808;&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x6536;&#x5230;autorelease&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C06;&#x5176;&#x653E;&#x5165;&#x6700;&#x9876;&#x7AEF;&#x7684;&#x6C60;&#x91CC;</li>
<li>&#x5408;&#x7406;&#x8FD0;&#x7528;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#xFF0C;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5B58;&#x5CF0;&#x503C;</li>
<li><code>autoreleasepool</code>&#x8FD9;&#x79CD;&#x65B0;&#x5F0F;&#x5199;&#x6CD5;&#x80FD;&#x521B;&#x5EFA;&#x66F4;&#x4E3A;&#x8F7B;&#x4FBF;&#x7684;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;</li>
</ul>
<h3 id="35&#x3001;&#x7528;&#x50F5;&#x5C38;&#x5BF9;&#x8C61;&#x8C03;&#x8BD5;&#x5185;&#x5B58;&#x95EE;&#x9898;">35&#x3001;&#x7528;<code>&#x50F5;&#x5C38;&#x5BF9;&#x8C61;</code>&#x8C03;&#x8BD5;&#x5185;&#x5B58;&#x95EE;&#x9898;</h3>
<p><code>&#x50F5;&#x5C38;&#x5BF9;&#x8C61;</code>&#x662F;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x529F;&#x80FD;&#x3002;&#x542F;&#x7528;&#x8FD9;&#x9879;&#x8C03;&#x8BD5;&#x529F;&#x80FD;&#x4E4B;&#x540E;&#xFF0C;&#x8FD0;&#x884C;&#x671F;&#x7CFB;&#x7EDF;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x5DF2;&#x7ECF;&#x56DE;&#x6536;&#x7684;&#x5B9E;&#x4F8B;&#x8F6C;&#x5316;&#x6210;&#x7279;&#x6B8A;&#x7684;&#x201C;&#x50F5;&#x5C38;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x771F;&#x6B63;&#x56DE;&#x6536;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x79CD;&#x5BF9;&#x8C61;&#x6240;&#x5728;&#x7684;&#x6838;&#x5FC3;&#x5185;&#x5B58;&#x65E0;&#x6CD5;&#x91CD;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x53EF;&#x80FD;&#x906D;&#x5230;&#x8986;&#x5199;&#x3002;&#x50F5;&#x5C38;&#x5BF9;&#x8C61;&#x6536;&#x5230;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5176;&#x4E2D;&#x51C6;&#x786E;&#x8BF4;&#x660E;&#x4E86;&#x53D1;&#x9001;&#x8FC7;&#x6765;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x63CF;&#x8FF0;&#x4E86;&#x56DE;&#x6536;&#x4E4B;&#x524D;&#x7684;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x50F5;&#x5C38;&#x5BF9;&#x8C61;&#x65F6;&#x8C03;&#x8BD5;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x95EE;&#x9898;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#x3002;</p>
<ul>
<li>&#x7CFB;&#x7EDF;&#x4F1A;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x7684;<code>isa</code>&#x7684;&#x6307;&#x9488;&#xFF0C;&#x4EE4;&#x5176;&#x6307;&#x5411;&#x7279;&#x6B8A;&#x7684;&#x50F5;&#x5C38;&#x7C7B;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x8BE5;&#x5BF9;&#x8C61;&#x53D8;&#x4E3A;&#x50F5;&#x5C38;&#x5BF9;&#x8C61;&#x3002;&#x50F5;&#x5C38;&#x7C7B;&#x80FD;&#x591F;&#x54CD;&#x5E94;&#x6240;&#x6709;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x54CD;&#x5E94;&#x7684;&#x65B9;&#x5F0F;&#x4E3A;&#xFF1A;&#x6253;&#x5370;&#x4E00;&#x6761;&#x5305;&#x542B;&#x8BE5;&#x6D88;&#x606F;&#x5185;&#x5B58;&#x53CA;&#x5176;&#x63A5;&#x6536;&#x8005;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x7EC8;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</li>
</ul>
<h3 id="36&#x3001;&#x4E0D;&#x8981;&#x4F7F;&#x7528;retaincount">36&#x3001;&#x4E0D;&#x8981;&#x4F7F;&#x7528;retainCount</h3>
<p><code>retainCount</code>&#x6B64;&#x65B9;&#x6CD5;&#x4E4B;&#x6240;&#x4EE5;&#x65E0;&#x7528;&#xFF0C;&#x5176;&#x9996;&#x8981;&#x539F;&#x56E0;&#x5728;&#x4E8E;&#xFF1A;&#x5B83;&#x8FD4;&#x56DE;&#x7684;&#x4FDD;&#x7559;&#x8BA1;&#x6570;&#x53EA;&#x662F;&#x67D0;&#x4E2A;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x4E0A;&#x7684;&#x503C;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5E76;&#x672A;&#x8003;&#x8651;&#x5230;&#x7CFB;&#x7EDF;&#x4F1A;&#x7A0D;&#x5019;&#x628A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x800C;&#x4E0D;&#x4F1A;&#x5C06;&#x540E;&#x7EED;&#x7684;&#x91CA;&#x653E;&#x64CD;&#x4F5C;&#x4ECE;&#x8FD4;&#x56DE;&#x503C;&#x91CC;&#x51CF;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6B64;&#x503C;&#x5C31;&#x672A;&#x5FC5;&#x80FD;&#x771F;&#x5B9E;&#x7684;&#x53CD;&#x5E94;&#x5B9E;&#x9645;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</p>
<p>&#x5176;&#x6B21;<code>retainCount</code>&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x8FD4;&#x56DE;0&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x7CFB;&#x7EDF;&#x4F1A;&#x4F18;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x91CA;&#x653E;&#x884C;&#x4E3A;&#xFF0C;&#x5728;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x8FD8;&#x662F;1&#x7684;&#x65F6;&#x5019;&#x5C31;&#x628A;&#x5B83;&#x56DE;&#x6536;&#x4E86;&#x3002;&#x53EA;&#x6709;&#x5728;&#x7CFB;&#x7EDF;&#x4E0D;&#x6253;&#x7B97;&#x8FD9;&#x4E48;&#x4F18;&#x5316;&#x65F6;&#xFF0C;&#x8BA1;&#x6570;&#x503C;&#x624D;&#x4F1A;&#x9012;&#x51CF;&#x81F3;0.&#x56E0;&#x6B64;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x5B8C;&#x5168;&#x4E3A;&#x96F6;&#x3002;</p>
<h4 id="&#x6807;&#x7B7E;&#x6307;&#x9488;&#xFF08;tagged-pointer&#xFF09;">&#x6807;&#x7B7E;&#x6307;&#x9488;&#xFF08;tagged pointer&#xFF09;</h4>
<p>&#x5728; 2013 &#x5E74; 9 &#x6708;&#xFF0C;&#x82F9;&#x679C;&#x63A8;&#x51FA;&#x4E86; iPhone5s &#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;iPhone5s &#x914D;&#x5907;&#x4E86;&#x9996;&#x4E2A;&#x91C7;&#x7528; 64 &#x4F4D;&#x67B6;&#x6784;&#x7684; A7 &#x53CC;&#x6838;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4E3A;&#x4E86;&#x8282;&#x7701;&#x5185;&#x5B58;&#x548C;&#x63D0;&#x9AD8;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;&#x82F9;&#x679C;&#x63D0;&#x51FA;&#x4E86;Tagged Pointer&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5BF9;&#x4E8E; 64 &#x4F4D;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F15;&#x5165; Tagged Pointer &#x540E;&#xFF0C;&#x76F8;&#x5173;&#x903B;&#x8F91;&#x80FD;&#x51CF;&#x5C11;&#x4E00;&#x534A;&#x7684;&#x5185;&#x5B58;&#x5360;&#x7528;&#xFF0C;&#x4EE5;&#x53CA; 3 &#x500D;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#xFF0C;100 &#x500D;&#x7684;&#x521B;&#x5EFA;&#x3001;&#x9500;&#x6BC1;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x3002;</p>
<p><img src="https://raw.githubusercontent.com/SirHeng/Necessary/master/Images/&#x6807;&#x7B7E;&#x6307;&#x9488;.jpg" alt="image"></p>
<p><img src="https://raw.githubusercontent.com/SirHeng/Necessary/master/Images/&#x6807;&#x7B7E;&#x6307;&#x9488;1.jpg" alt="image"></p>
<h2 id="&#x7B2C;&#x516D;&#x7AE0;-&#x5757;&#x4E0E;&#x5927;&#x4E2D;&#x67A2;&#x6D3E;&#x53D1;">&#x7B2C;&#x516D;&#x7AE0; &#x5757;&#x4E0E;&#x5927;&#x4E2D;&#x67A2;&#x6D3E;&#x53D1;</h2>
<h3 id="37&#x3001;&#x7406;&#x89E3;&#x5757;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;">37&#x3001;&#x7406;&#x89E3;&#x201C;&#x5757;&#x201D;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;</h3>
<p><img src="https://raw.githubusercontent.com/SirHeng/Necessary/master/Images/&#x5757;.png" alt="image"></p>
<h4 id="&#x5168;&#x5C40;block&#x3001;&#x6808;block&#x3001;&#x5806;block">&#x5168;&#x5C40;block&#x3001;&#x6808;block&#x3001;&#x5806;block</h4>
<h3 id="&#x4E3A;&#x5E38;&#x7528;&#x7684;&#x5757;&#x7C7B;&#x578B;&#x521B;&#x5EFA;typedef">&#x4E3A;&#x5E38;&#x7528;&#x7684;&#x5757;&#x7C7B;&#x578B;&#x521B;&#x5EFA;typedef</h3>
<p>__NSCFConstantString</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev " aria-label="Previous page: iOS">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="iOS知识点总结.html" class="navigation navigation-next " aria-label="Next page: iOS知识点总结">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Effective Objective-C 2.0","level":"1.2.1","depth":2,"next":{"title":"iOS知识点总结","level":"1.2.2","depth":2,"path":"iOS/iOS知识点总结.md","ref":"iOS/iOS知识点总结.md","articles":[]},"previous":{"title":"iOS","level":"1.2","depth":1,"path":"README.md","ref":"README.md","articles":[{"title":"Effective Objective-C 2.0","level":"1.2.1","depth":2,"path":"iOS/Effective Objective-C 2.0.md","ref":"iOS/Effective Objective-C 2.0.md","articles":[]},{"title":"iOS知识点总结","level":"1.2.2","depth":2,"path":"iOS/iOS知识点总结.md","ref":"iOS/iOS知识点总结.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["sequence","mermaid-v8","flow","uml"],"pluginsConfig":{"sequence":{"theme":"simple"},"mermaid-v8":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"flow":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"uml":{"format":"svg"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"iOS/Effective Objective-C 2.0.md","mtime":"2020-09-03T17:09:54.556Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-07T18:19:03.345Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        

    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-mermaid-v8/book/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

<script src="../gitbook/gitbook-plugin-mermaid-v8/mermaid/mermaid.min.js"></script>

    </body>
</html>

